package vigilantx.crypto.apps.cryptonotecli.runner;

/**
 * Перечисление доступных криптографических операций в VXCryptoNote CLI.
 */
public enum Operations {
	/**
	 * Генерация нового ключа и сертификата.
	 */
	keyGen,
	/**
	 * Просмотр списка ключей и сертификатов в хранилище.
	 */
	keyList,
	/**
	 * Импорт ключа и сертификата из файла в хранилище.
	 */
	keyImport,
	/**
	 * Экспорт ключа и сертификата из хранилища в файл.
	 */
	keyExport,
	/**
	 * Шифрование данных с использованием заданного ключа.
	 */
	encrypt,
	/**
	 * Дешифрование данных с использованием заданного ключа.
	 */
	decrypt
}